{
  "run_date": "2025-09-22",
  "fred_vintage": "2025-08-01",
  "inputs": {
    "FRED": {
      "FEDFUNDS": {
        "value": 4.33,
        "date": "2025-08-01"
      },
      "GS10": {
        "value": 4.26,
        "date": "2025-08-01"
      },
      "GS2": {
        "value": 3.7,
        "date": "2025-08-01"
      },
      "T10Y3M": {
        "value": 0.15,
        "date": "2025-09-22"
      },
      "CPIAUCSL": {
        "value": 323.364,
        "date": "2025-08-01"
      },
      "UNRATE": {
        "value": 4.3,
        "date": "2025-08-01"
      },
      "USREC": {
        "value": 0.0,
        "date": "2025-08-01"
      }
    },
    "competitor_apy": [
      {
        "institution": "Axos Bank",
        "apy": 4.46
      },
      {
        "institution": "Openbank by Santander",
        "apy": 4.2
      },
      {
        "institution": "Forbright Bank",
        "apy": 4.25
      },
      {
        "institution": "Western Alliance Bank",
        "apy": 4.25
      },
      {
        "institution": "E*TRADE",
        "apy": 4.0
      },
      {
        "institution": "Synchrony Bank",
        "apy": 3.8
      },
      {
        "institution": "Discover® Bank",
        "apy": 3.5
      },
      {
        "institution": "Marcus by Goldman Sachs",
        "apy": 3.65
      },
      {
        "institution": "SoFi",
        "apy": 3.8
      },
      {
        "institution": "Capital One",
        "apy": 3.5
      },
      {
        "institution": "Barclays",
        "apy": 3.9
      },
      {
        "institution": "UFB Direct",
        "apy": 3.9
      }
    ],
    "institution_apy": 4.46
  },
  "forecast": {
    "base": {
      "months": [
        3,
        6,
        12
      ],
      "balances": [
        1000,
        1020,
        1040
      ],
      "cost_of_funds": [
        4.33,
        4.33,
        4.33
      ],
      "nim": [
        -0.07,
        -0.07,
        -0.07
      ],
      "profit": [
        -0.18,
        -0.36,
        -0.73
      ]
    }
  },
  "summary": "American Express HYSA Profitability Forecast: August 2025\n\n**Executive Summary:**  Current macroeconomic conditions, characterized by a Federal Funds Rate (FEDFUNDS) of 4.33% and a 10-year Treasury yield (GS10) of 4.26%, present a challenging environment for HYSA profitability.  While American Express (Amex) is maintaining a competitive Annual Percentage Yield (APY) of 4.46%, mirroring top competitors like Axos Bank, our forecast indicates consistent net interest margin (NIM) losses and negative profitability over the next year.\n\n**Macroeconomic Drivers:** The relatively high FEDFUNDS rate, reflecting ongoing efforts to combat inflation, significantly increases our cost of funds.  The GS10 yield, while slightly below FEDFUNDS, further underscores the prevailing high-interest-rate environment.  This impacts profitability by increasing the cost of attracting and retaining deposits, even with a competitive APY.\n\n**Competitive Landscape:** Amex's 4.46% APY is highly competitive, matching the highest offerings in the market (Axos Bank).  However, the current landscape demonstrates a range of APYs from 3.5% (Discover, Capital One) to 4.46%, highlighting the intense competition for customer deposits in this segment.\n\n**Projected Profitability:** Our forecast projects consistent net interest margin (NIM) losses of -0.07% over the next 3, 6, and 12 months. This translates to accumulating losses of -$0.18, -$0.36, and -$0.73 million (assuming the forecasted balances). These projections assume a constant cost of funds mirroring the current FEDFUNDS rate.  This indicates that, even with a competitive APY, Amex's HYSA is currently operating at a loss under the present economic conditions.\n\n**Recommendation:**  We recommend a thorough review of the HYSA strategy.  Options include:  re-evaluating the target APY to balance competitiveness with profitability, exploring alternative funding sources to reduce cost of funds, or re-assessing the overall strategic importance of the HYSA product within the broader Amex portfolio given the current and forecast economic situation.  A sensitivity analysis examining various FEDFUNDS rate scenarios would also be prudent."
}