{
  "run_date": "2025-09-22",
  "fred_vintage": "2025-08-01",
  "inputs": {
    "FRED": {
      "FEDFUNDS": {
        "value": 4.33,
        "date": "2025-08-01"
      },
      "GS10": {
        "value": 4.26,
        "date": "2025-08-01"
      },
      "GS2": {
        "value": 3.7,
        "date": "2025-08-01"
      },
      "T10Y3M": {
        "value": 0.15,
        "date": "2025-09-22"
      },
      "CPIAUCSL": {
        "value": 323.364,
        "date": "2025-08-01"
      },
      "UNRATE": {
        "value": 4.3,
        "date": "2025-08-01"
      },
      "USREC": {
        "value": 0.0,
        "date": "2025-08-01"
      }
    },
    "competitor_apy": [
      {
        "institution": "Axos Bank",
        "apy": 4.46
      },
      {
        "institution": "Openbank by Santander",
        "apy": 4.2
      },
      {
        "institution": "Forbright Bank",
        "apy": 4.25
      },
      {
        "institution": "Western Alliance Bank",
        "apy": 4.25
      },
      {
        "institution": "E*TRADE",
        "apy": 4.0
      },
      {
        "institution": "Synchrony Bank",
        "apy": 3.8
      },
      {
        "institution": "Discover® Bank",
        "apy": 3.5
      },
      {
        "institution": "Marcus by Goldman Sachs",
        "apy": 3.65
      },
      {
        "institution": "SoFi",
        "apy": 3.8
      },
      {
        "institution": "Capital One",
        "apy": 3.5
      },
      {
        "institution": "Barclays",
        "apy": 3.9
      },
      {
        "institution": "UFB Direct",
        "apy": 3.9
      }
    ],
    "institution_apy": 4.46
  },
  "forecast": {
    "base": {
      "months": [
        3,
        6,
        12
      ],
      "balances": [
        1000,
        1020,
        1040
      ],
      "cost_of_funds": [
        4.33,
        4.33,
        4.33
      ],
      "nim": [
        -0.07,
        -0.07,
        -0.07
      ],
      "profit": [
        -0.18,
        -0.36,
        -0.73
      ]
    }
  },
  "summary": "American Express HYSA Profitability Forecast: August 2025\n\n**Executive Summary:**\n\nThis forecast projects a net interest margin (NIM) loss for American Express's High-Yield Savings Account (HYSA) despite a competitive APY.  While our 4.46% APY is currently in line with top market competitors (e.g., Axos Bank at 4.46%),  the prevailing macroeconomic environment presents challenges.  The current elevated Federal Funds Rate (FEDFUNDS) at 4.33% and a 10-year Treasury yield (GS10) of 4.26% necessitate a significant increase in our cost of funds, resulting in projected net losses.\n\n**Key Macro Drivers:**\n\n* **High Interest Rate Environment:**  The elevated FEDFUNDS rate (4.33%) directly impacts our cost of funds, squeezing profitability despite competitive APYs.  The relatively high GS10 (4.26%) reflects the overall cost of borrowing and contributes to pressure on margins.\n\n* **Competitive Landscape:** The HYSA market is fiercely competitive, with several institutions offering APYs exceeding 4% (Axos Bank, Openbank, Forbright Bank leading the pack).  Maintaining a competitive APY requires a careful balance between customer acquisition and profitability.\n\n**Profitability Projection:**\n\nOur forecast shows consistent NIM losses (-0.07% per month) and escalating net losses across various time horizons (-$0.18, -$0.36, and -$0.73 for 3, 6, and 12 months, respectively) assuming current balance projections. This scenario assumes a fixed cost of funds mirroring the current FEDFUNDS rate.\n\n**Recommendations:**\n\nWe must critically evaluate the following to improve HYSA profitability:\n\n1. **Cost of Funds Management:** Explore strategies to reduce the cost of funds, including diversifying funding sources and optimizing deposit mix.\n\n2. **Pricing Strategy:** Analyze the APY landscape and competitor offerings to determine the optimal balance between competitiveness and profitability. A slight reduction in APY could significantly improve margins.\n\n3. **Balance Growth Strategy:**  Implement strategies to increase HYSA account balances significantly.  Growth in deposits will be essential for offsetting the impact of the high cost of funds.\n\n4. **Fee Structure:**  Explore potential revenue generation through minimal, clearly communicated fees while maintaining customer satisfaction.\n\nIn conclusion, while maintaining a competitive APY is crucial, the current macro environment requires a strategic review of our HYSA strategy to achieve profitability. Immediate actions are required to mitigate the projected losses."
}