{
  "run_date": "2025-09-22",
  "fred_vintage": "2025-08-01",
  "inputs": {
    "FRED": {
      "FEDFUNDS": {
        "value": 4.33,
        "date": "2025-08-01"
      },
      "GS10": {
        "value": 4.26,
        "date": "2025-08-01"
      },
      "GS2": {
        "value": 3.7,
        "date": "2025-08-01"
      },
      "T10Y3M": {
        "value": 0.15,
        "date": "2025-09-22"
      },
      "CPIAUCSL": {
        "value": 323.364,
        "date": "2025-08-01"
      },
      "UNRATE": {
        "value": 4.3,
        "date": "2025-08-01"
      },
      "USREC": {
        "value": 0.0,
        "date": "2025-08-01"
      }
    },
    "competitor_apy": [
      {
        "institution": "Axos Bank",
        "apy": 4.46
      },
      {
        "institution": "Openbank by Santander",
        "apy": 4.2
      },
      {
        "institution": "Forbright Bank",
        "apy": 4.25
      },
      {
        "institution": "Western Alliance Bank",
        "apy": 4.25
      },
      {
        "institution": "E*TRADE",
        "apy": 4.0
      },
      {
        "institution": "Synchrony Bank",
        "apy": 3.8
      },
      {
        "institution": "Discover® Bank",
        "apy": 3.5
      },
      {
        "institution": "Marcus by Goldman Sachs",
        "apy": 3.65
      },
      {
        "institution": "SoFi",
        "apy": 3.8
      },
      {
        "institution": "Capital One",
        "apy": 3.5
      },
      {
        "institution": "Barclays",
        "apy": 3.9
      },
      {
        "institution": "UFB Direct",
        "apy": 3.9
      }
    ],
    "institution_apy": 4.46
  },
  "forecast": {
    "federal_rate": {
      "months": [
        3,
        6,
        12
      ],
      "balances": [
        1000,
        1020,
        1040
      ],
      "cost_of_funds": [
        4.33,
        4.33,
        4.33
      ],
      "nim": [
        -0.07,
        -0.07,
        -0.07
      ],
      "profit": [
        -0.18,
        -0.36,
        -0.73
      ]
    },
    "amex": {
      "months": [
        3,
        6,
        12
      ],
      "balances": [
        1000,
        1020,
        1040
      ],
      "cost_of_funds": [
        4.46,
        4.46,
        4.46
      ],
      "nim": [
        -0.2,
        -0.2,
        -0.2
      ],
      "profit": [
        -0.5,
        -1.02,
        -2.08
      ]
    }
  },
  "summary": "American Express High-Yield Savings Account (HYSA) Profitability Forecast: August 2025\n\n**Executive Summary:**  Current macroeconomic conditions, characterized by a Federal Funds rate (FEDFUNDS) of 4.33% and a 10-year Treasury yield (GS10) of 4.26%, present a challenging environment for HYSA profitability.  While American Express (AMEX) is matching the highest competitor APY at 4.46%,  our forecast indicates negative net interest margins (NIM) and profitability, exceeding losses compared to a scenario mirroring the Federal Funds Rate.  This necessitates a strategic review of our HYSA strategy.\n\n**Macroeconomic Drivers:**  The prevailing high interest rate environment, reflected in both FEDFUNDS and GS10, increases the cost of funds.  This directly impacts HYSA profitability as we are paying a higher rate to depositors than we are earning.  The current unemployment rate (UNRATE) of 4.3% suggests a still-strong economy, yet the potential for economic slowdown cannot be ignored.\n\n**Competitive Landscape:** The current APY landscape is highly competitive.  Several institutions offer APYs between 3.5% and 4.46%, putting significant pressure on margins.  AMEX’s current 4.46% APY, while competitive, is not sufficient to offset the cost of funds given our current structure.\n\n**Profitability Projection:** Our forecast reveals concerning profitability for the AMEX HYSA.  Matching the highest competitor rate results in a widening negative NIM of -0.2% across all forecast horizons (3, 6, and 12 months).  This translates to accumulating losses of -$0.5, -$1.02, and -$2.08 million for the respective periods, significantly exceeding the losses under a Federal Funds rate-mirrored cost of funds (-$0.18, -$0.36, and -$0.73 million).\n\n**Recommendations:** We recommend an immediate review of our HYSA pricing strategy, cost of funds, and overall product positioning to mitigate these projected losses. Options include, but are not limited to:\n\n* **Pricing Adjustment:** Explore a potential APY reduction to improve NIM.\n* **Cost Optimization:** Analyze our funding sources to identify potential cost-saving opportunities.\n* **Strategic Partnerships:** Evaluate opportunities to reduce operating costs through strategic partnerships.\n* **Product Differentiation:**  Explore offering additional value-added services to attract and retain customers.\n\nFailure to address these projections will result in continued and escalating losses in the HYSA product line.  A comprehensive strategic review is critical to ensure the long-term viability and profitability of this offering."
}